#Что делает

#Останавливает цикл.

for i in range(10):
    if i == 3:
        break
    print(i)

#Вывод:

#0
#1
#2

#Цикл остановился на 3.

#Задание

for i in range(1,11):
    if i == 3:
        break
    print(i)